Step 1: Connect To The Switch Via Console 
(Using A Console Cable And Terminal Emulation Software Such As Putty Or Tera Term)

Enable

Switch# configure terminal
Switch(config)#

Switch(config)# hostname access-switch1
access-switch1(config)#
access-switch1(config)# enable secret Cisco123

Step 2: Set Up A Host Name And Banner MOTD

access-switch1(config)# banner motd #Unauthorized access to this device is prohibited!# 
access-switch1(config)# enable secret Cisco123

Step 4: Configure Passwords For Telnet And Console Acess

access-switch1(config)# line vty 0 15
access-switch1(config-line)# password Cisco123
access-switch1(config-line)# login
access-switch1(config-line)# exit

access-switch1(config)# line console 0
access-switch1(config-line)# Cisco
access-switch1(config-line)# login
access-switch1(config-line)# exit

Step 5: Define The Allowed IP Address To Access Switch Via Telenet (Optional)

access-switch1(config)# ip access-list standard TELNET-ACCESS
access-switch1(config-std-nacl)# permit 10.1.1.100
access-switch1(config-std-nacl)# permit 10.1.1.101
access-switch1(config-std-nacl)# exit

ccess-switch1(config)# line vty 0 15
access-switch1(config-line)# access-class TELNET-ACCESS in
access-switch1(config-line)# exit
access-switch1(config)#


Step 6: Assign Ip Address For Switch Managment 

access-switch1(config)# interface vlan 1
access-switch1(config-if)# ip address 10.1.1.200 255.255.255.0
access-switch1(config-if)# exit
access-switch1(config)#


Step 7: Assign Default Gateway 

access-switch1(config)# ip default-gateway 10.1.1.254

Step 8: Disable Unsued Ports 

access-switch1(config)# interface range fe 0/25-48
access-switch1(config-if-range)# shutdown
access-switch1(config-if-range)# exit
access-switch1(config)#

Step 9: Save running configuration
:Copy run start
